# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'schniz/tap'

# Binaries
brew 'ripgrep'
brew 'tree'
brew 'jq'
brew 'fzf'
brew 'neovim'
brew 'mas'

# Cask Binaries
cask 'google-cloud-sdk'

# Development
brew 'node'
brew 'fnm'
brew 'yarn'
brew 'python'

# Apps
cask 'aerial'
cask 'iterm2'
cask 'spotify'
cask 'notion'
cask 'visual-studio-code'

# Appstore Apps
mas 'Xcode', id: 497799835

# Fonts
cask 'font-inconsolata'
