# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'schniz/tap'

# Binaries
brew 'coreutils' # Those that come with MacOS are out of date
brew 'ripgrep'
brew 'tree'
brew 'jq'
brew 'fzf'
brew 'neovim'
brew 'mas' # Mac App Store Manager
brew 'git-town'
brew 'fd'
brew 'bat' 
brew 'tree'
brew 'tokei'
brew 'jenv'
brew 'gradle'
brew 'hugo'
brew 'pass'
brew 'gh'

# oh-my-zsh theme
brew 'starship'

# Cask Binaries
cask 'google-cloud-sdk'
# cask 'java'

# Development
# brew 'node'
brew 'fnm'
# brew 'yarn'
# brew 'python'

# Apps
cask 'aerial'
cask 'iterm2'
cask 'spotify'
cask 'notion'
cask 'qtpass'
cask 'visual-studio-code'
cask 'graphql-playground'
cask 'insomnia'
cask 'firefox-developer-edition'

# Appstore Apps
# mas 'Xcode', id: 497799835
mas 'Giphy Capture', id: 668208984

# Fonts
cask 'font-inconsolata'
cask 'font-oxygen-mono'
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-fira-mono-for-powerline' 

